Tekla.Structures.DialogInternal.ShapeAttributeRequestArgs
Argument for attribute request event

Tekla.Structures.DialogInternal.ShapeAttributeRequestArgs.Attributes
Gets the rebar attributes

Tekla.Structures.DialogInternal.ShapeAttributeRequestArgs.#ctor(Tekla.Structures.DialogInternal.ShapeAttributes)
Construct AttributeRequestArgs
attributes: Rebar attributes